<a href="https://colab.research.google.com/github/talbotg5128/GroupAssignmentOne/blob/master/Group_Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%sql sqlite:///hotelDatabase.db

'Connected: @hotelDatabase.db'

In [1]:
%%sql   
DROP TABLE IF EXISTS Rooms;
CREATE TABLE Rooms (Room_num integer primary key, Room_Type text, Floor_Num integer, Num_beds integer, Guest_ID integer, Employee_ID integer);
DROP TABLE IF EXISTS Guests;
Create TABLE Guests (Guest_ID integer primary key, Room_Num integer, Num_Nights integer, Total_Cost real, Firstname text, Lastname text);
DROP TABLE IF EXISTS HotelAmenities;
Create TABLE HotelAmenities (Amentity_Name text primary key, Room_Num integer, Overhead_Cost real, Floor_Num integer);
DROP TABLE IF EXISTS Linens;
CREATE TABLE Linens (Linen Type text primary key, Linen_Type_Num integer, Linen_Cost real, Color_Of_Linen text, Room_Num integer);
DROP TABLE IF EXISTS Employees;
CREATE TABLE Employees (Employee_ID integer primary key, Firstname text, Lastname text, Job_Position text, Salary real);


INSERT INTO Rooms VALUES(101, 'standard', 1, 2, 0001, 0001);
INSERT INTO Rooms VALUES(102, 'standard', 1, 2, 0566, 0002);
INSERT INTO Rooms VALUES(103, 'deluxe', 1, 4, 0003, 0003);

INSERT INTO Rooms VALUES(201, 'standard', 2, 2, 0004, 0004);
INSERT INTO Rooms VALUES(202, 'standard', 2, 2, 0002, 0005);
INSERT INTO Rooms VALUES(203, 'deluxe', 2, 4, 3225, 0001);

INSERT INTO Rooms VALUES(301, 'standard', 3, 2, 4698, 0002);
INSERT INTO Rooms VALUES(302, 'standard', 3, 2, 0005, 0003);
INSERT INTO Rooms VALUES(303, 'deluxe', 3, 4, 4522, 0004);

INSERT INTO Guests VALUES(0001, 101, 3, 291.68, 'Luke', 'Foster');
INSERT INTO Guests VALUES(0002, 202, 4, 575.23, 'Scott', 'Newman');
INSERT INTO Guests VALUES(0003, 103, 3, 336.47, 'Robert', 'Walker');
INSERT INTO Guests VALUES(0004, 201, 2, 452.48, 'Linda', 'Carson');
INSERT INTO Guests VALUES(0005, 302, 5, 636.33, 'Emily', 'Pearson');

INSERT INTO HotelAmenities VALUES('Pool', 1, 500000, 1);
INSERT INTO HotelAmenities VALUES('Sauna', 2, 200000, 2);
INSERT INTO HotelAmenities VALUES('Restaurant 1', 3, 700000, 1);
INSERT INTO HotelAmenities VALUES('Restaurant 2', 4, 200000, 2);
INSERT INTO HotelAmenities VALUES('Store', 5, 100000, 1);

INSERT INTO Linens VALUES('Small Bath Towel', 100, 10, 'White', 102);
INSERT INTO Linens VALUES('Medium Bath Towel', 100, 20, 'White', 101);
INSERT INTO Linens VALUES('Large Bath Towel', 100, 30, 'White', 201);
INSERT INTO Linens VALUES('Small Hand Towel', 100, 10, 'Blue', 202);
INSERT INTO Linens VALUES('Large Hand Towel', 100, 20, 'Blue', 301);

INSERT INTO Employees VALUES(0001, "Noah", "Philips", 'Housekeeper', 30000);
INSERT INTO Employees VALUES(0002, "Anna", "Gomez", 'Manager', 60000);
INSERT INTO Employees VALUES(0003, "Tyler", "Hunt", 'Server', 40000);
INSERT INTO Employees VALUES(0004, "Lily", "Booth", 'Housekeeper', 30000);
INSERT INTO Employees VALUES(0005, "Gary", "Cooper", 'Server', 40000);

UsageError: Cell magic `%%sql` not found.

Which employee earns the highest salary?

In [ ]:
%%sql
SELECT max (Salary), Firstname, Lastname from Employees ORDER BY Salary

 * sqlite:///hotelDatabase.db
Done.

[(60000.0, 'Anna', 'Gomez')]

This question is important because it shows a user's ability to search within a specific database and shows how to order a set of strings in alphabetical order. This demonstrates the ORDER BY method which is a helpful tool to be able to utilize when constructing a list or a data set.

What room is the sauna in?

In [ ]:
%%sql
SELECT Room_Num, Floor_Num FROM HotelAmenities WHERE Amentity_Name = "Sauna"

 * sqlite:///hotelDatabase.db
Done.

[(2, 2)]

This question showcases a skill to search for a specific name of an attribute within an entity class. It searches for a specific name of a room and provides the location in the results. This ran the way as expected and provides the user with an accurate location of the hotel amentity.

What are the hotel amentities on the first floor?

In [ ]:
%%sql
SELECT Amentity_Name FROM HotelAmenities WHERE Floor_Num = 1

 * sqlite:///hotelDatabase.db
Done.

[('Pool',), ('Restaurant 1',), ('Store',)]

This question and answer will search through the hotel amentities table and return a list of amentities on the first floor. This question is important because it shows the user multiple results for the question and prompts the program to search within the database for multiple results instead of just one. This is important to gather information on when searching in a list.